﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:  <W83627DHGSetup.uni>
//
// Description: SIO Form String Definitions
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

//If customer define the common logical device by themselves, add here.

#string STR_W83627DHG_SIO_FORM                        #language eng "W83627DHG Super IO Configuration"
#string STR_W83627DHG_SIO_FORM_HELP                   #language eng "System Super IO Chip Parameters."
#string STR_W83627DHG_SIO_PROMPT                      #language eng "Super IO Chip"
#string STR_W83627DHG                                 #language eng "W83627DHG"

//
//Floppy Settings
//

//
//Serial 1/2 Settings
//
//
//COMB Settings
//
#string STR_W83627DHG_COMB_MODE1                      #language eng "Standard Serial Port Mode"
#string STR_W83627DHG_COMB_MODE2                      #language eng "IrDA Active pulse 1.6 uS"
#string STR_W83627DHG_COMB_MODE3                      #language eng "IrDA Active pulse 3/16 bit time"
#string STR_W83627DHG_COMB_MODE4                      #language eng "ASKIR Mode"

//
//Parallel Settings
//
#string STR_W83627DHG_PARALLEL_IO378_IRQ5             #language eng "IO=378h; IRQ=5;"
#string STR_W83627DHG_PARALLEL_IO378_IRQX             #language eng "IO=378h; IRQ=5,6,7,9,10,11,12;"
#string STR_W83627DHG_PARALLEL_IO278_IRQX             #language eng "IO=278h; IRQ=5,6,7,9,10,11,12;"
#string STR_W83627DHG_PARALLEL_IO3BC_IRQX             #language eng "IO=3BCh; IRQ=5,6,7,9,10,11,12;"

#string STR_W83627DHG_PARALLELE_IO378_778_IRQ5_DMA3   #language eng "IO=378h; IRQ=5; DMA=3;"
#string STR_W83627DHG_PARALLELE_IO378_778_IRQX_DMAX   #language eng "IO=378h; IRQ=5,6,7,9,10,11,12; DMA=1,3;"
#string STR_W83627DHG_PARALLELE_IO278_678_IRQX_DMAX   #language eng "IO=278h; IRQ=5,6,7,9,10,11,12; DMA=1,3;"
#string STR_W83627DHG_PARALLELE_IO3BC_7BC_IRQX_DMAX   #language eng "IO=3BCh; IRQ=5,6,7,9,10,11,12; DMA=1,3;"

#string STR_W83627DHG_PARALLEL_MODE0                  #language eng "STD Printer Mode"
#string STR_W83627DHG_PARALLEL_MODE1                  #language eng "SPP Mode"
#string STR_W83627DHG_PARALLEL_MODE2                  #language eng "EPP-1.9 and SPP Mode"
#string STR_W83627DHG_PARALLEL_MODE3                  #language eng "EPP-1.7 and SPP Mode"
#string STR_W83627DHG_PARALLEL_MODE4                  #language eng "ECP Mode"
#string STR_W83627DHG_PARALLEL_MODE5                  #language eng "ECP and EPP 1.9 Mode"
#string STR_W83627DHG_PARALLEL_MODE6                  #language eng "ECP and EPP 1.7 Mode"
#string STR_W83627DHG_PARALLEL_MODE_HELP              #language eng "Change the Printer Port mode."

//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************